mslab.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Master's Thesis in MSLab: Differentiable simulation of mass-sprig simulations with contact</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Magí Romanyà Serrasolsas" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">Master's Thesis in MSLab: Differentiable simulation of mass-sprig simulations with contact</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8f8bcd2">Abstract:</a></li>
</ul>
</div>
</div>
<p>
I did my master's thesis in MSLab under the supervision of Dr. Miguel Angel Otaduy.
The main focus on the thesis was to investigate differentiable simulation when discontinuous contact interactions are introduced.
We used a simple simulation of mass-spring cloths as a foundation to our experiments, developed in c++ and python.
In this work, we observed problems in the gradients when dealing with caothic systems.
We also introduced a novel derivation of the back propagation algorithm for computing the gradients.
</p>

<div id="outline-container-org8f8bcd2" class="outline-2">
<h2 id="org8f8bcd2">Abstract:</h2>
<div class="outline-text-2" id="text-org8f8bcd2">
<p>
The discontinuous nature of contact interactions poses a challenge for gradient-based control in physical systems.
In our study, we derived and implemented a differentiable mass-spring simulation to investigate the predicted gradients and the process of optimization with and without contact.
Our research introduces a novel derivation of the back-propagation method, adding physical meaning to adjoint variables.
Our findings suggest that the anomalies in gradients during contact interactions may be attributed to sensitivities in initial conditions, rather than the contact discontinuities.
</p>

<p>
The full text of the work can be found <a href="resources/tfm.pdf">here</a>.
Also I have written a small post about differentiable simulation and a web demo <a href="differential_simulation.html">here</a>.
</p>

<p>
<a href="index.html">Go Back</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Magí Romanyà Serrasolsas</p>
</div>
</body>
</html>
